blog/2018/06/24/mostly-harmless.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-01-04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Mostly Harmless</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Adam Schwartz">
<link rel="stylesheet" href="../../../../css/style.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
</head>
<body>
<div id="preamble" class="status">
<p>Published:&nbsp;June 24, 2018</p>
</div>
<div id="content">
<ul class="org-ul nav">
<li><a href="../../../../index.html">About</a></li>
<li><a href="../../../index.html">Blog</a></li>
<li><a href="../../../../ceramics/index.html">Ceramics</a></li>
<li><a href="https://github.com/anschwa">Github</a></li>
</ul>

<div id="outline-container-org482de17" class="outline-2">
<h2 id="org482de17">Mostly Harmless</h2>
<div class="outline-text-2" id="text-org482de17">
<p>
<i>The Hitchhiker&rsquo;s Guide to the Galaxy</i> is one of my favorite books.
Douglas Adams was heavily influenced by society&rsquo;s ever growing
dependence on technology and the unintended side effects of automated
systems. In this way, the C programming language truly embodies the
spirit of Adam&rsquo;s work.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>A mostly harmless program:</label><pre class="src src-C"><code><span style="font-weight: bold;">#include</span> <span style="color: #a52a2a;">&lt;stdio.h&gt;</span></code>
<code></code>
<code><span style="font-weight: bold;">#define</span> SIX 1+5</code>
<code><span style="font-weight: bold;">#define</span> NINE 8+1</code>
<code></code>
<code>int main() {</code>
<code>    printf(<span style="color: #a52a2a;">"%d * %d = %d\n"</span>, SIX, NINE, SIX * NINE);</code>
<code>    return 0;</code>
<code>}</code>
</pre>
</div>

<pre class="example">
6 * 9 = 42
</pre>


<blockquote>
<p>
&ldquo;It can be very dangerous to see things from somebody else&rsquo;s point of
view without the proper training.&rdquo;
</p>

<p>
— Douglas Adams, <i>Mostly Harmless</i>
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last&nbsp;updated:&nbsp;2022-01-04</p>
</div>
</body>
</html>
